{
    "menu": {
        "about": "About",
        "experience": "Experience",
        "education": "Education",
        "projects": "Projects"
    },
    "experiences": {
        "heading": "Experience",
        "items": [
            {
                "period": "Feb. 2020 - Jun. 2020",
                "title": "Full Stack Developer Intern",
                "company": "Gfi World",
                "location": "Niort, France",
                "description": "Implemented two modules of an internal project monitoring tool, including a financial summary and quality management overview for a selected contract.",
                "details": [
                    "During my final year internship, I had the opportunity to work on an internal monitoring tool aiming to provide different project management key indicators to multiple types of users. I was in charge of a financial summary and a quality management overview modules, either interfaced with another internal tool or fully independent.",
                    "Thanks to the specifications provided, I was able to build these modules from the backend (data structures, services, management...) to the frontend (global interface, UX, web services consumption...).",
                    "I have also faced different stakes concerning security and good practices aspects thanks to a general Fortify analysis and personal reflections given the ressources I was manipulating.",
                    "These modules are now integrated to the global solution and will be soon brought to use by different people."
                ],
                "skills": [
                    "ReactJS",
                    "Java EE",
                    "Spring Boot",
                    "JPA",
                    "Hibernate",
                    "RESTful API"
                ]
            },
            {
                "period": "Apr. 2019 - Jul. 2019",
                "title": "Java Developer Intern",
                "company": "L3i laboratory",
                "location": "La Rochelle, France",
                "description": "Improved Pepper’s robot interaction scenarios by introducing a new modelling based on contextual graphs and ensuring models robustness in a dedicated web editor.",
                "details": [
                    "Nope"
                ],
                "skills": [
                    "Java",
                    "JAXB",
                    "data modelling",
                    "XML",
                    "JavaScript"
                ]
            },
            {
                "period": "Apr. 2018 - Jun. 2018",
                "title": "Android Developer Intern",
                "company": "L3i laboratory",
                "location": "La Rochelle, France",
                "description": "Enhanced museum visitors experience by creating a companion mobile application and provided information visualisation to the personnel by collecting usage data.",
                "details": [
                    "Nope"
                ],
                "skills": [
                    "Android native",
                    "Java",
                    "Node.js",
                    "UI design"
                ]
            },
            {
                "period": "Aug. 2016",
                "title": "Web Developer Intern",
                "company": "PlusCom Communication Agency",
                "location": "La Rochelle, France",
                "description": "Participated in several web development projects for multiple clients, mainly involving need assessment while adding or updating content and functionnalities.",
                "details": [
                    "Nope"
                ],
                "skills": [
                    "JavaScript",
                    "PHP",
                    "SQL",
                    "UI design"
                ]
            }
        ]
    },
    "education": {
        "heading": "Education",
        "items": [
            {
                "type": "en_master",
                "title": "MSc Computer Science in Software Engineering",
                "result": "Upper Second Class Honours - C.M.I. labelled - La Rochelle University",
                "description": "Five-year based master's degree from September 2015 to July 2020 following the bachelor's master's doctorate European educational system, with three first years dedicated to a bachelor’s degree in Software Development followed by two years of the master's degree.",
                "link": "#",
                "detailedContent": [
                    {
                        "title": "MSc Computer Science in Software Engineering",
                        "result": "Graduated with Upper Second Class Honours - July 2020",
                        "description": [
                            "Master's degree attended from September 2018 to June 2020 at La Rochelle University, France. Approched thematics during my studies included web services development, code quality and quality assurance, agile methodologies, concurrent and parallel programming, mobility/GIS, big data and Web 3.0.",
                            "Other topics include communication, quality and sustainable development, industrial property, digital rights, research and marketing.",
                            "One of my side activities included the role of class representative for which I was the favored interlocutor between students and lecturers and has been involved in the Master's degree's Development Board."
                        ],
                        "linkedProjects": [
                            {
                                "title": "Archive Client for Patient File Consultation",
                                "link": "#"
                            },
                            {
                                "title": "Géoluciole mobile app",
                                "link": "#"
                            }
                        ],
                        "experience": [
                            {
                                "title": "Full Stack Developer",
                                "link": "#"
                            },
                            {
                                "title": "Java Developer",
                                "link": "#"
                            }
                        ],
                        "link": "#"
                    },
                    {
                        "title": "BSc Computer Science in Software Development",
                        "result": "First Class Honours - June 2018",
                        "description": [
                            "Bachelor's degree attended from September 2015 to June 2018, including an Erasmus+ semester at NUIG."
                        ],
                        "linkedProjects": [
                            {
                                "title": "Plant health care monitoring solution",
                                "link": "#"
                            }
                        ],
                        "link": "#"
                    },
                    {
                        "title": "Erasmus+ semester - NUIG",
                        "description": [
                            "Erasmus+ semester from September to December 2017 at the National University of Ireland Galway as part of the third year of my bachelor's degree."
                        ]
                    },
                    {
                        "title": "C.M.I. complementary five-year university programme",
                        "result": "Labelled - July 2020",
                        "description": [
                            "Complementary five-year university programme attended from Septembre 2015 to June 2020 focused on communication, business, and research. Additional courses compared to the basic bachelor's master's system were attended, aiming to develop engineering competencies and the ability of abstraction."
                        ],
                        "link": "#"
                    }
                ]
            },
            {
                "type": "normal",
                "title": "French Scientific Baccalaureate",
                "result": "Mention Bien (With Merit) - June 2015",
                "description": "Obtained with further Physics and Chemistry. Equivalent of A or A* in Mathematics, Engineering and Philosophy, equivalent of B in Physics & Chemistry, English and Spanish.",
                "link": "#"
            }
        ]
    }
}