{
    "menu": {
        "about": "About",
        "experience": "Experience",
        "education": "Education",
        "projects": "Projects"
    },
    "footer": {
        "copyright": "Antoine Orgerit, 2020. All rights reserved."
    },
    "home": {
        "title": "Software Engineering Graduate",
        "skillsHighlight": {
            "heading": "Knowledge in:",
            "items": [
                "Java",
                "JavaScript",
                "ReactJS",
                "Spring Boot",
                "Node.js",
                "SQL",
                "NoSQL",
                "ORM",
                "Go",
                "Scala",
                "Android",
                "RESTful API",
                "Agile methods"
            ]
        },
        "developerSection": {
            "heading": "Combining development and key values",
            "content": "As a Software Engineering graduate, software development is in the heart of my everyday life point of view. From front-end to back-end, I try to put my work under sustainability, quality and reusability principles. This aims to emphasize evolution, either of the project itself or concepts and guidelines.",
            "button": "Learn more about me"
        },
        "experienceSection": {
            "heading": "Varied experience and interest",
            "content": "Experience is what values, through competencies and subjects. My professional experience reflects my curiosity about most topics of information technology (public or private interests, research, practices...). Still, I am mostly oriented to Full Stack stakes: data modeling, web services exposure, web or mobile front end solutions...",
            "button": "Check my background experience"
        },
        "projectsSection": {
            "heading": "Continuously learning, with projects",
            "content": "I had several occasions to work on interesting projects during my academic studies, and a lot awaiting the perfect time to be developed. Either for learning a new programming language or to develop my skills, these projects are a way to show what I (and sometimes we) are able of while mixing a bit of project management.",
            "button": "See some of my projects"
        }
    },
    "about": {
        "heading": "About",
        "presentation": {
            "heading": "A French Graduate in the U.K.",
            "content": "My name is Antoine Orgerit. I am a graduate of a Master's degree in Software Engineering from La Rochelle University (France) and a skilled developer with approximately one year background experience in development, from front-end to back-end. As a recent graduate, I have now relocated to Birmingham where I am currently looking for opportunities to boost my career. Working in an international environment has always been an objective to me and would allow me to grow even further.",
            "resumeButton": "Download my resume"
        },
        "knowledge": {
            "heading": "Skills and knowledge",
            "content": "Through my academic and profesionnal experiences, I have been able to look at different aspects of information technology that allowed me to build a strong interest in Full Stack. I particularly like to see beyond the programming itself to provide an answer to a given stake and consider many other aspects: data manipulation and its representation, user experience, project requirements in terms of scalability and adaptability, continuous quality assessment, documentation... But this does not prevent me from being versed in several programming languages and frameworks.",
            "skills": {
                "soft": [
                    "Technology literacy",
                    "Problem solving",
                    "Critical thinking",
                    "Time-management",
                    "Attention to detail"
                ],
                "hard": [
                    "Code quality",
                    "Quality assurance",
                    "Documentation",
                    "Unit testing",
                    "Data modeling",
                    "User experience",
                    "Data analysis",
                    "Java",
                    "JPA",
                    "Spring Boot",
                    "Maven",
                    "Git",
                    "Agile methods",
                    "Android native",
                    "SQL",
                    "NoSQL",
                    "Node.js",
                    "JavaScript",
                    "ReactJS",
                    "RESTful API",
                    "Go",
                    "Scala",
                    "HL7/FHIR"
                ]
            }
        },
        "itCertifications": {
            "heading": "Certified skills",
            "description": "I have had several opportunities to obtain IT certifications during my further studies, mainly as part of my master's degree. Some of them are exclusive to La Rochelle University, member of the INR (Institut du Numérique Responsable, or Responsible Digital Institute).",
            "certifications": [
                {
                    "title": "Responsible Digital (Green IT)",
                    "link": "https://www.dropbox.com/s/pzg8zx7b1pveqi9/certification-numerique-responsable.pdf?dl=0"
                },
                {
                    "title": "Web Eco-design (Green IT)",
                    "link": "https://www.dropbox.com/s/o19ql0wqk7hdtoj/certification-ecoconception-web.pdf?dl=0"
                },
                {
                    "title": "C2i Level 2 – Engineering professions",
                    "link": "https://www.dropbox.com/s/tyfe6hq7j78kbei/c2i_niveau2_MI.pdf?dl=0"
                },
                {
                    "title": "Google Digital Garage",
                    "link": "https://www.dropbox.com/s/3qsgz9u036jkvdk/certification-google-ateliers-numeriques.pdf?dl=0"
                }
            ]
        },
        "languagesCertifications": {
            "heading": "Language proficiency",
            "description": "In addition to my knowledge in information technology, I have certified language proficiency in English and French. As well as French being my native language, I have also had the chance to develop my English during my Erasmus+ semester in Ireland. I also have a basic knowledge of Spanish.",
            "certifications": [
                {
                    "title": "English - TOEIC Listening & Reading certificed C1 level",
                    "link": "https://www.dropbox.com/s/eo8e8tqzuc7bwhj/certification-toeic.pdf?dl=0"
                },
                {
                    "title": "French - Voltaire Certification with French Business Level",
                    "link": "https://www.dropbox.com/s/q8xfxa1jlwjhr0x/certification-voltaire.pdf?dl=0"
                }
            ]
        }
    },
    "experiences": {
        "heading": "Experience",
        "items": [
            {
                "period": "Feb. 2020 - Jun. 2020",
                "title": "Full Stack Developer Intern",
                "company": "Gfi World",
                "location": "Niort, France",
                "description": "Implemented two modules of an internal project monitoring tool, including a financial summary and quality management overview for a selected contract.",
                "details": [
                    "During my final year internship, I had the opportunity to work on an internal monitoring tool aiming to provide different project management key indicators to multiple types of users. I was in charge of a financial summary and a quality management overview modules, either interfaced with another internal tool or fully independent.",
                    "Thanks to the specifications provided, I was able to build these modules from the back-end (data structures, services, requests management...) to the front-end (global interface, UX, web services consumption...).",
                    "I have also faced different stakes concerning security and good practices aspects thanks to a general Fortify analysis and personal reflections given the ressources I was manipulating.",
                    "These modules are now integrated to the global solution and will be soon brought to use by different people."
                ],
                "skills": [
                    "ReactJS",
                    "Java EE",
                    "Spring Boot",
                    "JPA",
                    "Hibernate",
                    "RESTful API"
                ]
            },
            {
                "period": "Apr. 2019 - Jul. 2019",
                "title": "Java Developer Intern",
                "company": "L3i laboratory",
                "location": "La Rochelle, France",
                "description": "Improved Pepper’s robot interaction scenarios by introducing a new modelling based on contextual graphs and ensuring models robustness in a dedicated web editor.",
                "details": [
                    "As part of a general research topic around digital innovation in museums and cultural places named \"e-culture\" of the L3i Laboratory, I have been brought to work on Pepper's robot interactions with visitors. More specifically, a new modelling of its interaction scenarios was conceived to make it more dynamic.",
                    "Guided by a researcher, I have used contextual graphs to develop a new modelling in Java that would allow to run different interaction scenarios. These scenarios are able to communicate and/or synchronise depending on a given context thanks to the JADE platform and instruct specific commands to the robot.",
                    "A dedicated web editor has also been developed to help end-users to conceive their interaction scenarios while allowing a visual representation of them and ensuring conceived models robustness through several model checking properties."
                ],
                "skills": [
                    "Java",
                    "JAXB",
                    "Data modelling",
                    "XML",
                    "JavaScript"
                ]
            },
            {
                "period": "Apr. 2018 - Jun. 2018",
                "title": "Android Developer Intern",
                "company": "L3i laboratory",
                "location": "La Rochelle, France",
                "description": "Enhanced museum visitors experience by creating a companion mobile application and provided information visualisation to the personnel by collecting usage data.",
                "details": [
                    "My work during this internship aimed to answer a specific demand from the Natural Science Museum of La Rochelle: offering an application installed on available tablets for its visitors. This application would help people to visit the museum while offering some content linked to the different thematics of the rooms.",
                    "I had to continue a previous work from a master's degree student to develop functionnalities and finalise some aspects: support of multiple languages, additional content link sound or videos, plans display, etc. All the work provided was developed for Android tablets, therefore using Java to conceive the native Android app.",
                    "Aside of this was a dedicated user interface to display collected data of the visits using the application, previsouly collected with consent and sent to a server. Different figures were chosen to help understand which rooms are the most popular, the paths followed by visitors..."
                ],
                "skills": [
                    "Android native",
                    "Java",
                    "Node.js",
                    "UI design"
                ]
            },
            {
                "period": "Aug. 2016",
                "title": "Web Developer Intern",
                "company": "PlusCom Communication Agency",
                "location": "La Rochelle, France",
                "description": "Participated in several web development projects for multiple clients, mainly involving need assessment while adding or updating content and functionnalities.",
                "details": [
                    "As part of this \"First Steps in Business\" internship, I have been involved in day to day development requirements of the communication agency. Even if my role was mainly to modify websites content, it is the contact with different clients that was probably the most interesting part.",
                    "Understanding their needs and trying to answer it precisely were key parts of my work."
                ],
                "skills": [
                    "JavaScript",
                    "PHP",
                    "SQL",
                    "UI design"
                ]
            }
        ]
    },
    "education": {
        "heading": "Education",
        "diplomaButton": "See the diploma",
        "projectsHeading": "Projects",
        "experienceHeading": "Internships",
        "items": [
            {
                "type": "en_master",
                "title": "MSc Computer Science in Software Engineering",
                "result": "Upper Second Class Honours - C.M.I. labelled - La Rochelle University",
                "description": [
                    "Five-year based master's degree from September 2015 to July 2020 following the bachelor's master's doctorate European educational system, with three first years dedicated to a bachelor’s degree in Software Development followed by two years of the master's degree."
                ],
                "link": "#",
                "detailedContent": [
                    {
                        "title": "MSc Computer Science in Software Engineering",
                        "result": "Graduated with Upper Second Class Honours - July 2020",
                        "description": [
                            "Master's degree attended from September 2018 to June 2020 at La Rochelle University, France. Approched thematics during my studies included web services development, code quality and quality assurance, agile methodologies, concurrent and parallel programming, mobility/GIS, big data and Web 3.0.",
                            "Other topics include communication, quality and sustainable development, industrial property, digital rights, research and marketing.",
                            "One of my side activities included the role of class representative for which I was the favored interlocutor between students and lecturers and have been involved in the Master's degree's Development Board."
                        ],
                        "linkedProjects": [
                            {
                                "title": "Archive Client for Patient File Consultation",
                                "link": "#"
                            },
                            {
                                "title": "Géoluciole mobile app",
                                "link": "#"
                            }
                        ],
                        "experience": [
                            {
                                "title": "Full Stack Developer",
                                "link": "#"
                            },
                            {
                                "title": "Java Developer",
                                "link": "#"
                            }
                        ],
                        "link": "#"
                    },
                    {
                        "title": "BSc Computer Science in Software Development",
                        "result": "First Class Honours - June 2018",
                        "description": [
                            "Bachelor's degree attended from September 2015 to June 2018, including an Erasmus+ semester at NUIG."
                        ],
                        "linkedProjects": [
                            {
                                "title": "Plant health care monitoring solution",
                                "link": "#"
                            }
                        ],
                        "experience": [
                            {
                                "title": "Android Developer",
                                "link": "#"
                            },
                            {
                                "title": "Web Developer",
                                "link": "#"
                            }
                        ],
                        "link": "#"
                    },
                    {
                        "title": "Erasmus+ semester - NUIG",
                        "description": [
                            "Erasmus+ semester from September to December 2017 at the National University of Ireland Galway as part of the third year of my bachelor's degree."
                        ]
                    },
                    {
                        "title": "C.M.I. complementary five-year university programme",
                        "result": "Labelled - July 2020",
                        "description": [
                            "Complementary five-year university programme attended from Septembre 2015 to June 2020 focused on communication, business, and research. Additional courses compared to the basic bachelor's master's system were attended, aiming to develop engineering competencies and the ability of abstraction."
                        ],
                        "link": "#"
                    }
                ]
            },
            {
                "type": "normal",
                "title": "French Scientific Baccalaureate",
                "result": "Mention Bien (With Merit) - June 2015",
                "description": [
                    "Obtained with further Physics and Chemistry. Equivalent of A or A* in Mathematics, Engineering and Philosophy, equivalent of B in Physics & Chemistry, English and Spanish."
                ],
                "link": "#"
            }
        ]
    },
    "contact": {
        "information": {
            "heading": "Interested to get in touch with me?",
            "content": "To discuss about a project, an opportunity or simply to get more information about me, you can use my contact details to send me an email or a message via LinkedIn or WhatsApp. You can also consult some of my profiles on the web.",
            "websiteRequest": "Any suggestion about this website or noticed a bug? Please send me an email to"
        },
        "emailHeading": "By email",
        "webHeading": "On the web",
        "phoneHeading": "By phone"
    }
}