{
    "menu": {
        "about": "À propos",
        "experience": "Expérience",
        "education": "Formation",
        "projects": "Projets"
    },
    "footer": {
        "copyright": "Antoine Orgerit, 2020. Tous droits réservés."
    },
    "home": {
        "title": "Diplômé en Master Architecte Logiciel",
        "skillsHighlight": {
            "heading": "Connaissances en :",
            "items": [
                "Java",
                "JavaScript",
                "ReactJS",
                "Spring Boot",
                "Node.js",
                "SQL",
                "NoSQL",
                "ORM",
                "Go",
                "Scala",
                "Android",
                "RESTful API",
                "Méthodes Agiles"
            ]
        },
        "developerSection": {
            "heading": "Développement et valeurs clefs",
            "content": "En tant que diplômé en Master Architecte Logiciel, le développement logiciel est au coeur de ma vision de tous les jours. Du front-end au back-end, j'essaie régulièrement d'associer à mon travail certains principes de développement durable, de qualité et de réutilisabilité. Cela favorise ainsi les possibles évolutions, tant sur le projet même que sur certains concepts ou bonnes pratiques.",
            "button": "En savoir plus sur moi"
        },
        "experienceSection": {
            "heading": "Expérience et intérêt variés",
            "content": "L'expérience est ce qui importe probablement le plus, autant à travers les compétences mises en place que les enjeux dont on essaye de répondre. Si mon expérience professionelle reflète ma curiosité sur la plupart des sujets informatiques (intérêts publics ou privés, domaine de la recherche, pratiques...), je reste néanmoins majoritairement orienté vers les enjeux du développement Full Stack : modélisation de données, exposition de services web, solutions front-end web ou mobiles...",
            "button": "Consulter mon expérience"
        },
        "projectsSection": {
            "heading": "Progresser à travers des projets",
            "content": "J'ai eu plusieurs occasions de travailler sur des projets intéressants durant mes études supérieures, et beaucoup attendent encore d'être développés au moment opportun. Autant pour apprendre un nouveau langage de programmation que pour développer mes compétences, ces projets sont une manière de démontrer ce que je suis capable (ou parfois ce que nous sommes capables) de concevoir tout en mêlant quelques aspects de gestion de projet.",
            "button": "Voir mes projets"
        }
    },
    "about": {
        "heading": "À propos",
        "presentation": {
            "heading": "Un diplômé français au Royaume-Uni",
            "content": "Je suis Antoine Orgerit, diplômé d'un Master Informatique Architecte Logiciel de La Rochelle Université et un développeur compétent ave environ un an d'expérience en développement, du front-end au back-end. En tant que jeune diplômé, je me suis désormais relocalisé à Birmingham au Royaume-Uni où je suis actuellement en recherche d'une opportunité permettant de booster ma carrière professionnelle. Travailler dans un environnement international a toujours été un de mes objectifs et me permettrait de me développer encore plus.",
            "resumeButton": "Télécharger mon CV"
        },
        "knowledge": {
            "heading": "Aptitudes et connaissances",
            "content": "À travers mes expériences académiques et professionnelles, j'ai eu la possibilité d'étudier de près ou de loin les différents aspects de l'informatique tout en construisant un intérêt certain pour le full stack. J'apprécie particulièrement voir au-delà de la programmation même pour répondre à un enjeu et considérer d'autres points d'intérêt : la gestion et la manipulation des données ainsi que leur représentation, l'expérience utilisateur, les besoins d'un projet en termes d'extensibilité et d'adaptivité, l'évaluation de la qualité en continue, la documentation... Cela ne m'empêche néanmoins pas des familier à plusieurs langages de programmation et frameworks.",
            "skills": {
                "soft": [
                    "Culture technologique",
                    "Résolution de problèmes",
                    "Esprit critique",
                    "Gestion du temps",
                    "Souci du détail"
                ],
                "hard": [
                    "Qualité de code",
                    "Assurance qualité",
                    "Documentation",
                    "Tests unitaires",
                    "Modélisation de données",
                    "Expérience utilisateur",
                    "Analyse de données",
                    "Java",
                    "JPA",
                    "Spring Boot",
                    "Maven",
                    "Git",
                    "Méthodes Agiles",
                    "Android native",
                    "SQL",
                    "NoSQL",
                    "Node.js",
                    "JavaScript",
                    "ReactJS",
                    "RESTful API",
                    "Go",
                    "Scala",
                    "HL7/FHIR"
                ]
            }
        },
        "itCertifications": {
            "heading": "Compétences certifiées",
            "description": "Durant mes études supérieures, et en particulier durant mon Master, j'ai eu plusieurs occasions d'obtenir des certifications informatiques. Certaines d'entre elles sont exclusives à La Rochelle Université, membre de l'INR (Institut du Numérique Responsable).",
            "certifications": [
                {
                    "title": "Numérique Responsable (Green IT)",
                    "link": "#"
                },
                {
                    "title": "Écoconception Web (Green IT)",
                    "link": "#"
                },
                {
                    "title": "C2i Niveau 2 – Métiers de l'Ingénieur",
                    "link": "#"
                },
                {
                    "title": "Google Ateliers Numériques",
                    "link": "#"
                }
            ]
        },
        "languagesCertifications": {
            "heading": "Abilités linguistiques",
            "description": "En plus de l'ensemble de mes compétences en informatique, mes compétences en Français et en Anglais ont pu être certifiées. J'ai notamment eu la chance de développer mes compétences en Anglais durant mon semestre Erasmus+ en Irelande. J'ai également quelques connaissances basiques en Espagnol.",
            "certifications": [
                {
                    "title": "Français - Certification Voltaire Niveau Affaires",
                    "link": "#"
                },
                {
                    "title": "Anglais - TOEIC Listening & Reading certifié niveau C1",
                    "link": "#"
                }
            ]
        }
    },
    "experiences": {
        "heading": "Expériences Professionnelles",
        "items": [
            {
                "period": "Févr. 2020 - Juin 2020",
                "title": "Stagiaire Développeur Full Stack",
                "company": "Gfi Informatique",
                "location": "Niort, France",
                "description": "Développement de deux modules dans le cadre d'un outil interne de pilotage des projets, incluant différents aspects financiers et des indicateurs de qualité pour un contrat.",
                "details": [
                    "During my final year internship, I had the opportunity to work on an internal monitoring tool aiming to provide different project management key indicators to multiple types of users. I was in charge of a financial summary and a quality management overview modules, either interfaced with another internal tool or fully independent.",
                    "Thanks to the specifications provided, I was able to build these modules from the backend (data structures, services, management...) to the frontend (global interface, UX, web services consumption...).",
                    "I have also faced different stakes concerning security and good practices aspects thanks to a general Fortify analysis and personal reflections given the ressources I was manipulating.",
                    "These modules are now integrated to the global solution and will be soon brought to use by different people."
                ],
                "skills": [
                    "ReactJS",
                    "Java EE",
                    "Spring Boot",
                    "JPA",
                    "Hibernate",
                    "RESTful API"
                ]
            },
            {
                "period": "Avr. 2019 - Juill. 2019",
                "title": "Stagiraire Développeur Java",
                "company": "Laboratoire L3i",
                "location": "La Rochelle, France",
                "description": "Amélioration des scénarios d’interaction des robots Nao et Pepper par l’introduction d’une nouvelle modélisation à base de graphes de contexte, tout en assurant la robustesse des modèles produits par le biais d’un vérificateur de propriétés dédié.",
                "details": [
                    "Nope"
                ],
                "skills": [
                    "Java",
                    "JAXB",
                    "data modelling",
                    "XML",
                    "JavaScript"
                ]
            },
            {
                "period": "Avr. 2018 - Juin 2018",
                "title": "Stagiraire Développeur Android",
                "company": "Laboratoire L3i",
                "location": "La Rochelle, France",
                "description": "Plus-value de l’expérience des visiteurs du Muséum de La Rochelle par la mise à disposition d’une application compagnon sur tablettes numériques et le fournissement au personnel d’une visualisation des informations récoltées des différentes visites.",
                "details": [
                    "Nope"
                ],
                "skills": [
                    "Android native",
                    "Java",
                    "Node.js",
                    "UI design"
                ]
            },
            {
                "period": "Août 2016",
                "title": "Stagiraire Développeur Web",
                "company": "Agence de Communication PlusCom",
                "location": "La Rochelle, France",
                "description": "Participation dans plusieurs projets de développement web pour différents clients, impliquant principalement l'étude des besoins tout en apportant des ajouts ou modifications sur du contenu ou des fonctionnalités.",
                "details": [
                    "Nope"
                ],
                "skills": [
                    "JavaScript",
                    "PHP",
                    "SQL",
                    "UI design"
                ]
            }
        ]
    },
    "education": {
        "heading": "Formation",
        "diplomaButton": "Voir le diplôme",
        "projectsHeading": "Projets ",
        "experienceHeading": "Expériences ",
        "items": [
            {
                "type": "normal",
                "title": "Master Informatique Parcours Architecte Logiciel",
                "result": "Mention Bien - La Rochelle Université - Juillet 2020",
                "description": [
                    "Diplôme de Master suivi de Septembre 2018 à Juin 2020 à La Rochelle Université, France. Les thématiques abordées durant mes études incluent notamment le développement de services web, l'ingénierie logicielle et les métriques de qualité, les méthodes agiles, la programmation concurrente et parallèle, la mobilité et les SIG, le big data et le Web 3.0. Certains sujets complémentaires concernent la communication, l'informatique durable, la propriété industrielle, le droit du numérique, la recherche et le marketing.",
                    "Par le biais des projets et des expériences entrepris durant ce cursus en addition à l'ensemble des connaissances acquises, mon parcours en Master a été un véritable tremplin vers le monde professionnel."
                ],
                "linkedProjects": [
                    {
                        "title": "Client d'Archivage pour des Dossiers Patient",
                        "link": "#"
                    },
                    {
                        "title": "Application Mobile Géoluciole",
                        "link": "#"
                    }
                ],
                "experience": [
                    {
                        "title": "Développeur Full Stack",
                        "link": "#"
                    },
                    {
                        "title": "Développeur Java",
                        "link": "#"
                    }
                ],
                "link": "#"
            },
            {
                "type": "normal",
                "title": "Cursus Master Ingénierie C.M.I.",
                "result": "Labellisé - Juillet 2020",
                "description": [
                    "Formation complémentaire sélective sur 5 ans focalisée sur la communication, le monde de l'entreprise et la recherche. Ce cursus m'a offert des connaissances additionnelles par rapport au parcours Licence-Master classique dans l'objectif de développer des compétences de niveau ingénieur et une capacité d'abstraction plus approfondie."
                ],
                "link": "#"
            },
            {
                "type": "complementary",
                "title": "Semestre Erasmus+",
                "description": [
                    "Semestre Erasmus+ effectué de Septembre à Décembre 2017 à la National University of Ireland Galway dans le cadre de la troisième année du diplôme de Licence.",
                    "C'est par le biais de cette première expérience à l'étranger que ma carrière professionnelle a évoluée vers l'international tout en renforçant mes connaissances du domaine d'un point de vue tant commun que différencié."
                ]
            },
            {
                "type": "normal",
                "title": "Licence Informatique Parcours Développement Logiciel",
                "result": "Mention Très Bien - Juin 2018",
                "description": [
                    "Diplôme de Licence suivi de Septembre 2015 à Juin 2018, incluant un semestre Erasmus+ à la National University of Ireland Galway. Les différentes compétences offertes couvrent notamment les différents paradigmes de programmation (orienté objet, fonctionnelle, impérative...), le développement web, des concepts généraux et bonnes pratiques de programmation, et le développement front-end, back-end et mobile.",
                    "Même si les plus grands apports de cette formation sont particulièrement l'appropriation de différents langages de programmation et plus généralement des principes qui les composent, elle m'a également permis de conforter mes choix de carrière tout en me donnant envie d'aller plus loin et parfois de manière plus abstraite dans les sujets composant l'informatique."
                ],
                "linkedProjects": [
                    {
                        "title": "Solution de Vérification de l'État de Santé d'une Plante",
                        "link": "#"
                    }
                ],
                "experience": [
                    {
                        "title": "Développeur Android",
                        "link": "#"
                    },
                    {
                        "title": "Développeur Web",
                        "link": "#"
                    }
                ],
                "link": "#"
            },
            {
                "type": "normal",
                "title": "Baccalauréat Scientifique - Sciences de l'Ingénieur",
                "result": "Mention Bien - Juin 2015",
                "description": [
                    "Baccalauréat Scientifique obtenu avec specialité Physique-Chimie.",
                    "Le parcours Sciences de l'Ingénieur m'a permis de découvrir et de me spécialiser durant mes études supérieures dans l'informatique."
                ],
                "link": "#"
            }
        ]
    },
    "contact": {
        "information": {
            "heading": "Vous souhaitez me contacter ?",
            "content": "Pour discuter d'un projet, d'une opportunité ou pour simplement obtenir plus d'informations sur moi, vous pouvez utiliser mes informations de contact pour m'envoyer un e-mail ou un message via LinkedIn ou WhatsApp. Vous pouvez également consulter mes différents profiles sur le web.",
            "websiteRequest": "Une suggestion concernant ce site ou vous avez remarqué un bug ? Merci de m'envoyer un e-mail à "
        },
        "emailHeading": "Par e-mail",
        "webHeading": "Sur le web",
        "phoneHeading": "Par téléphone"
    }
}