{
    "menu": {
        "about": "À propos",
        "experience": "Expérience",
        "education": "Formation",
        "projects": "Projets"
    },
    "footer": {
        "copyright": "Antoine Orgerit, 2020. Tous droits réservés."
    },
    "home": {
        "title": "Diplômé en Master Architecte Logiciel",
        "skillsHighlight": {
            "heading": "Connaissances en :",
            "items": [
                "Java",
                "JavaScript",
                "ReactJS",
                "Spring Boot",
                "Node.js",
                "SQL",
                "NoSQL",
                "ORM",
                "Go",
                "Scala",
                "Android",
                "RESTful API",
                "Méthodes Agiles"
            ]
        },
        "developerSection": {
            "heading": "Développement et valeurs clefs",
            "content": "En tant que diplômé en Master Architecte Logiciel, le développement logiciel est au coeur de ma vision de tous les jours. Du front-end au back-end, j'essaie régulièrement d'associer à mon travail certains principes de développement durable, de qualité et de réutilisabilité. Cela favorise ainsi les possibles évolutions, tant sur le projet même que sur certains concepts ou bonnes pratiques.",
            "button": "En savoir plus sur moi"
        },
        "experienceSection": {
            "heading": "Expériences et intérêts variés",
            "content": "L'expérience est ce qui importe probablement le plus, autant à travers les compétences mises en place que les enjeux dont on essaye de répondre. Si mon expérience professionelle reflète ma curiosité sur la plupart des sujets informatiques (intérêts publics ou privés, domaine de la recherche, pratiques...), je reste néanmoins majoritairement orienté vers les enjeux du développement Full Stack : modélisation de données, exposition de services web, solutions front-end web ou mobiles...",
            "button": "Consulter mon expérience"
        },
        "projectsSection": {
            "heading": "Progresser à travers des projets",
            "content": "J'ai eu plusieurs occasions de travailler sur des projets intéressants durant mes études supérieures, et beaucoup attendent encore d'être développés au moment opportun. Autant pour apprendre un nouveau langage de programmation que pour développer mes compétences, ces projets sont une manière de démontrer ce que je suis capable (ou parfois ce que nous sommes capables) de concevoir tout en mêlant quelques aspects de gestion de projet.",
            "button": "Voir mes projets"
        }
    },
    "about": {
        "heading": "À propos",
        "presentation": {
            "heading": "Un diplômé français au Royaume-Uni",
            "content": "Je suis Antoine Orgerit, diplômé d'un Master Informatique Architecte Logiciel de La Rochelle Université et un développeur compétent possédant environ un an d'expérience en développement, du front-end au back-end. En tant que jeune diplômé, je me suis désormais relocalisé à Birmingham au Royaume-Uni où je suis actuellement en recherche d'une opportunité permettant de booster ma carrière professionnelle. Travailler dans un environnement international a toujours été un de mes objectifs et me permettrait de me développer encore plus.",
            "resumeButton": "Télécharger mon CV"
        },
        "knowledge": {
            "heading": "Aptitudes et connaissances",
            "content": "À travers mes expériences académiques et professionnelles, j'ai eu la possibilité d'étudier de près ou de loin les différents aspects de l'informatique tout en construisant un intérêt certain pour le full stack. J'apprécie particulièrement voir au-delà de la programmation même pour répondre à un enjeu et considérer d'autres points d'intérêt : la gestion et la manipulation des données ainsi que leur représentation, l'expérience utilisateur, les besoins d'un projet en termes d'extensibilité et d'adaptivité, l'évaluation de la qualité en continue, la documentation... Cela ne m'empêche néanmoins pas des familier à plusieurs langages de programmation et frameworks.",
            "skills": {
                "soft": [
                    "Culture technologique",
                    "Résolution de problèmes",
                    "Esprit critique",
                    "Gestion du temps",
                    "Souci du détail"
                ],
                "hard": [
                    "Qualité de code",
                    "Assurance qualité",
                    "Documentation",
                    "Tests unitaires",
                    "Modélisation de données",
                    "Expérience utilisateur",
                    "Analyse de données",
                    "Java",
                    "JPA",
                    "Spring Boot",
                    "Maven",
                    "Git",
                    "Méthodes Agiles",
                    "Android native",
                    "SQL",
                    "NoSQL",
                    "Node.js",
                    "JavaScript",
                    "ReactJS",
                    "RESTful API",
                    "Go",
                    "Scala",
                    "HL7/FHIR"
                ]
            }
        },
        "itCertifications": {
            "heading": "Compétences certifiées",
            "description": "Durant mes études supérieures, et en particulier durant mon Master, j'ai eu plusieurs occasions d'obtenir des certifications informatiques. Certaines d'entre elles sont exclusives à La Rochelle Université, membre de l'INR (Institut du Numérique Responsable).",
            "certifications": [
                {
                    "title": "Numérique Responsable (Green IT)",
                    "link": "https://www.dropbox.com/s/pzg8zx7b1pveqi9/certification-numerique-responsable.pdf?dl=0"
                },
                {
                    "title": "Écoconception Web (Green IT)",
                    "link": "https://www.dropbox.com/s/o19ql0wqk7hdtoj/certification-ecoconception-web.pdf?dl=0"
                },
                {
                    "title": "C2i Niveau 2 – Métiers de l'Ingénieur",
                    "link": "https://www.dropbox.com/s/tyfe6hq7j78kbei/c2i_niveau2_MI.pdf?dl=0"
                },
                {
                    "title": "Google Ateliers Numériques",
                    "link": "https://www.dropbox.com/s/3qsgz9u036jkvdk/certification-google-ateliers-numeriques.pdf?dl=0"
                }
            ]
        },
        "languagesCertifications": {
            "heading": "Abilités linguistiques",
            "description": "En plus de l'ensemble de mes compétences en informatique, mes compétences en Français et en Anglais ont pu être certifiées. J'ai notamment eu la chance de développer mes compétences en Anglais durant mon semestre Erasmus+ en Irelande. J'ai également quelques connaissances basiques en Espagnol.",
            "certifications": [
                {
                    "title": "Français - Certification Voltaire Niveau Affaires",
                    "link": "https://www.dropbox.com/s/q8xfxa1jlwjhr0x/certification-voltaire.pdf?dl=0"
                },
                {
                    "title": "Anglais - TOEIC Listening & Reading certifié niveau C1",
                    "link": "https://www.dropbox.com/s/eo8e8tqzuc7bwhj/certification-toeic.pdf?dl=0"
                }
            ]
        }
    },
    "experiences": {
        "heading": "Expériences Professionnelles",
        "seeMore": "Voir plus",
        "items": [
            {
                "bookmark": "2020-gfi-full-stack-developer",
                "period": "Févr. 2020 - Juin 2020",
                "title": "Stagiaire Développeur Full Stack",
                "company": "Gfi Informatique",
                "location": "Niort, France",
                "description": "Développement de deux modules dans le cadre d'un outil interne de pilotage des projets, incluant différents aspects financiers et des indicateurs de qualité pour un contrat.",
                "details": [
                    "Durant mon stage de fin d'études, j'ai eu l'occasion de travailler sur un outil de pilotage interne visant à offrir à différents utilisateurs des indicateurs dans le cadre de la gestion des projets de l'entreprise. J'ai été en charge des modules du récapitulatif financier en interfaçage avec un autre outil interne et de la vision générale des indicateurs de qualité.",
                    "Grâce aux spécifications transmises, j'ai été en capacité de développer ces modules du back-end (structures de données, services, gestion des requêtes...) vers le front-end (interface générale, expérience utilisateur, consommation des services web...).",
                    "J'ai également été confronté à différents enjeux de sécurité et des aspects de bonnes pratiques grâce à une analyse Fortify générale et des réflexions personnelles portant sur les ressources à manipuler.",
                    "Ces modules sont désormais intégrés à l'ensemble de l'outil interne et seront bientôt disponibles auprès des utilisateurs finaux."
                ],
                "skills": [
                    "ReactJS",
                    "Java EE",
                    "Spring Boot",
                    "JPA",
                    "Hibernate",
                    "RESTful API"
                ]
            },
            {
                "bookmark": "2019-l3i-java-developer",
                "period": "Avr. 2019 - Juill. 2019",
                "title": "Stagiaire Développeur Java",
                "company": "Laboratoire L3i",
                "location": "La Rochelle, France",
                "description": "Amélioration des scénarios d’interaction des robots Nao et Pepper par l’introduction d’une nouvelle modélisation à base de graphes de contexte, tout en assurant la robustesse des modèles produits par le biais d’un vérificateur de propriétés dédié.",
                "details": [
                    "Dans le cadre du domaine générale de recherche e-culture portant sur les innovations digitales dans les musées et lieux culturel du Laboratoire L3i, j'ai été amené à travailler sur le robot Pepper et ses interactions avec les visiteurs. Une nouvelle modélisation de ses scénarios d'interaction a été plus particulièrement conçue pour le rendre plus dynamique.",
                    "Guidé par mon enseignant-chercheur référant, j'ai utilisé les graphes de contexte pour développer une nouvelle modélisation en Java permettant d'exécuter différents scénarios d'interaction. Ces derniers sont capables de communiquer et/ou de se synchroniser en fonction d'un contexte d'évolution particulier grâce à la plateforme JADE et de faire exécuter des instructions spécifique au robot.",
                    "Un éditeur web dédié a également été développé pour aider les utilisateurs finaux à concevoir leurs scénarios d'interaction tout en offrant une représentation visuelle de ces derniers et en assurant la robustesse des modèles produits à travers la vérification de différentes propriétés."
                ],
                "skills": [
                    "Java",
                    "JAXB",
                    "Data modelling",
                    "XML",
                    "JavaScript"
                ]
            },
            {
                "bookmark": "2018-l3i-android-developer",
                "period": "Avr. 2018 - Juin 2018",
                "title": "Stagiaire Développeur Android",
                "company": "Laboratoire L3i",
                "location": "La Rochelle, France",
                "description": "Plus-value de l’expérience des visiteurs du Muséum de La Rochelle par la mise à disposition d’une application compagnon sur tablettes numériques et le fournissement au personnel d’une visualisation des informations récoltées des différentes visites.",
                "details": [
                    "Mon travail durant se stage visait à répondre à une demande spécifique de la part du Muséum d'Histoire Naturelle de La Rochelle : proposer à ses visiteurs une application sur différentes tablettes mises à disposition. Cette dernière se positionne en tant qu'application compagnon à la visite du muséum tout en offrant du contenu thématique en fonction des salles visitées.",
                    "J'ai alors continué le travail d'un précédent étudiant de Licence Informatique afin de développer des fonctionnalités et finaliser certains aspects : support de plusieurs langues, contenu additionnel audio ou vidéo, affichage des plans du muséum, etc. Les tablettes utilisées fonctionnant sous Android, l'ensemble du travail réalisé utilise donc le language Java pour concevoir une application Android native.",
                    "En se basant sur des données collectées durant l'utilisation de l'application avec le consentement de l'utilisateur, une interface web a également été proposée à destination du personnel du muséum. Différentes visualisations ont été intégrées pour tenter de définir les salles les plus visitées, les trajets suivis par les visiteurs..."
                ],
                "skills": [
                    "Android native",
                    "Java",
                    "Node.js",
                    "UI design"
                ]
            },
            {
                "bookmark": "2016-pluscom-web-developer",
                "period": "Août 2016",
                "title": "Stagiaire Développeur Web",
                "company": "Agence de Communication PlusCom",
                "location": "La Rochelle, France",
                "description": "Participation dans plusieurs projets de développement web pour différents clients, impliquant principalement l'étude des besoins tout en apportant des ajouts ou modifications sur du contenu ou des fonctionnalités.",
                "details": [
                    "Dans le cadre de ce stage \"Découverte de l'Entreprise\", j'ai participé aux différents besoins de développement web de l'agence de communication. Si la modification de contenu constituait la grande majorité de mon rôle, ce sont les contacts avec les clients qui constituent probablement le plus grand intérêt de ce stage.",
                    "La compréhension de leurs besoins et tenter d'y répondre avec précision ont été des composants clefs de mon travail."
                ],
                "skills": [
                    "JavaScript",
                    "PHP",
                    "SQL",
                    "UI design"
                ]
            }
        ]
    },
    "education": {
        "heading": "Formation",
        "diplomaButton": "Voir le diplôme",
        "projectsHeading": "Projets ",
        "experienceHeading": "Expériences ",
        "items": [
            {
                "type": "normal",
                "title": "Master Informatique Parcours Architecte Logiciel",
                "result": "Mention Bien - La Rochelle Université - Juillet 2020",
                "description": [
                    "Diplôme de Master suivi de Septembre 2018 à Juin 2020 à La Rochelle Université, France. Les thématiques abordées durant mes études incluent notamment le développement de services web, l'ingénierie logicielle et les métriques de qualité, les méthodes agiles, la programmation concurrente et parallèle, la mobilité et les SIG, le big data et le Web 3.0. Certains sujets complémentaires concernent la communication, l'informatique durable, la propriété industrielle, le droit du numérique, la recherche et le marketing.",
                    "Par le biais des projets et des expériences professionnelles entrepris durant ce cursus, mon parcours en Master a été un véritable tremplin vers le monde professionnel en addition à l'ensemble des connaissances acquises."
                ],
                "linkedProjects": [
                    {
                        "title": "Application Mobile Géoluciole",
                        "link": "/projects#geoluciole"
                    },
                    {
                        "title": "Découverte du Laboratoire L3i",
                        "link": "/projects#l3i-game"
                    },
                    {
                        "title": "Client d'Archivage pour des Dossiers Patient",
                        "link": "/projects#archive-client"
                    }
                ],
                "experience": [
                    {
                        "title": "Développeur Full Stack",
                        "link": "/experience#2020-gfi-full-stack-developer"
                    },
                    {
                        "title": "Développeur Java",
                        "link": "/experience#2019-l3i-java-developer"
                    }
                ],
                "link": "https://www.dropbox.com/s/fslt1u6dg3nr4sa/attestation-reussite-master.pdf?dl=0"
            },
            {
                "type": "complementary",
                "title": "Cursus Master Ingénierie C.M.I.",
                "result": "Labellisé - Juillet 2020",
                "description": [
                    "Formation complémentaire sélective sur 5 ans focalisée sur la communication, le monde de l'entreprise et la recherche. Ce cursus m'a offert des connaissances additionnelles par rapport au parcours Licence-Master classique dans l'objectif de développer des compétences de niveau ingénieur et une capacité d'abstraction plus approfondie."
                ]
            },
            {
                "type": "complementary",
                "title": "Semestre Erasmus+",
                "description": [
                    "Semestre Erasmus+ effectué de Septembre à Décembre 2017 à la National University of Ireland Galway dans le cadre de la troisième année du diplôme de Licence.",
                    "C'est par le biais de cette première expérience à l'étranger que ma carrière professionnelle a évoluée vers l'international tout en renforçant mes connaissances en adoptant un point de vue quelque peu différencié sur le domaine informatique."
                ]
            },
            {
                "type": "normal",
                "title": "Licence Informatique Parcours Développement Logiciel",
                "result": "Mention Très Bien - Juin 2018",
                "description": [
                    "Diplôme de Licence suivi de Septembre 2015 à Juin 2018, incluant un semestre Erasmus+ à la National University of Ireland Galway. Les différentes compétences offertes couvrent notamment les différents paradigmes de programmation (orientée objet, fonctionnelle, impérative...), le développement web, des concepts généraux et bonnes pratiques de programmation, et le développement front-end, back-end et mobile.",
                    "Même si les plus grands apports de cette formation sont particulièrement l'appropriation de différents langages de programmation et plus généralement des principes qui les composent, elle m'a également permis de conforter mes choix de carrière tout en me donnant envie d'aller plus loin et parfois de manière plus abstraite dans les sujets composant l'informatique."
                ],
                "linkedProjects": [
                    {
                        "title": "Solution de Vérification de l'État de Santé d'une Plante",
                        "link": "/projects#plant-health-monitoring"
                    },
                    {
                        "title": "État de l'art : Documents hybrides et interaction crossmédia",
                        "link": "/projects#research-paper"
                    }
                ],
                "experience": [
                    {
                        "title": "Développeur Android",
                        "link": "/experience#2018-l3i-android-developer"
                    },
                    {
                        "title": "Développeur Web",
                        "link": "/experience#2016-pluscom-web-developer"
                    }
                ],
                "link": "https://www.dropbox.com/s/srqpleppf9vzfk8/diplome_licence.pdf?dl=0"
            },
            {
                "type": "normal",
                "title": "Baccalauréat Scientifique - Sciences de l'Ingénieur",
                "result": "Mention Bien - Juin 2015",
                "description": [
                    "Baccalauréat Scientifique obtenu avec specialité Physique-Chimie.",
                    "Le parcours Sciences de l'Ingénieur m'a permis de découvrir et de me spécialiser durant mes études supérieures dans l'informatique."
                ],
                "link": "https://www.dropbox.com/s/8k5a2nd58i690db/bac.pdf?dl=0"
            }
        ]
    },
    "projects": {
        "heading": "Projets",
        "more": {
            "heading": "Code source et plus de projets sur",
            "conjunction": "et"
        },
        "items": [
            {
                "bookmark": "personal-website",
                "title": "Site Internet personel",
                "type": "web",
                "description": "Mon premier projet à l'issue de l'obtention de mon diplôme de Master est le développement de mon site Internet personnel. Utilisant ReactJS, ce dernier présente des informations sur mes études, expériences professionnelles et projets de manière plus appronfondie qu'un CV classique, dont le thème général reprend néanmoins certaines caractéristiques.",
                "skills": [
                    "ReactJS",
                    "Expérience utilisateur",
                    "Conception d'interface",
                    "Intégration continue"
                ]
            },
            {
                "bookmark": "geoluciole",
                "title": "Application Mobile Géoluciole",
                "numberPeople": 9,
                "endUser": "L3i Laboratory",
                "type": "mobile",
                "description": "Ce projet de fin d'études dans le cadre de mon Master a été dévelopé avec 8 autres étudiants. L'application vise à pouvoir géolocaliser des visiteurs de la ville de La Rochelle dans le cadre d'un projet de recherche d'une doctorante, permettant par la suite de déterminer de possibles lieux d'intérêts. Une application Android et iOS natives ont été conçues tout en introduisant certains aspects de gamification afin d'inciter les visiteurs à utiliser l'application sans pour autant biaiser leur comportement.",
                "skills": [
                    "Android native",
                    "Java",
                    "UI design",
                    "Agile methodologies",
                    "GIS"
                ]
            },
            {
                "bookmark": "l3i-game",
                "title": "Découverte du Laboratoire L3i",
                "numberPeople": 2,
                "type": "mobile",
                "description": "Dans le cadre d'un cours sur la mobilité, cette application mobile a été développée pour être utiliser lors des journées portes ouvertes du Laboratoire L3i. En utilisant des QR Codes placés devant les bureaux des différents chercheurs, les visiteurs peuvent alors découvrir les différents thèmes de recherche et projets tout en répondant à différentes questions à l'aide des informations données. Codée à l'aide de JavaScript et PhoneGap, un système de score est également présent pour augmenter l'intérêt de l'utilisateur.",
                "skills": [
                    "PhoneGap",
                    "JavaScript",
                    "UI design",
                    "User experience",
                    "Gamification"
                ]
            },
            {
                "bookmark": "archive-client",
                "title": "Client d'Archivage pour des Dossiers Patient",
                "numberPeople": 4,
                "endUser": "OpenXtrem",
                "type": "desktop",
                "description": "La société OpenXtrem offre plusieurs solutions dans le domaine de la santé, l'une d'entre elles étant la plateforme en ligne MediBoard. En consommant cette plateforme, un client d'archivage a été développé pour télécharger vers ce dernier des ressources patients utilisants l'ensemble des standards internationaux HL7 tout en permettant de télécharger vers la plateforme différents documents liés (copie de carte vitale, ordonnances...). Ce client se présente en tant qu'application de bureau grâce à Electron.",
                "skills": [
                    "Electron",
                    "JavaScript",
                    "API consumption",
                    "HL7/FHIR"
                ]
            },
            {
                "bookmark": "plant-health-monitoring",
                "title": "Solution de Vérification de l'État de Santé d'une Plante",
                "numberPeople": 12,
                "endUser": "Cuculus GmbH",
                "type": "global solution",
                "description": "Grâce à l'utilisation de capteurs collectant des informations sur l'environnement d'une plante, une solution complète a été proposée pour permettre aux utilisateurs finaux de vérifier l'état de sante de leur plante. Un serveur développé avec Node.js est en capacité d'obtenir les informations transmises par les capteurs, tandis qu'une application mobile web peut requêter et obtenir auprès du serveur les informations pour une plante identifiée. Des notifications peuvent également être émises par l'application en cas d'action requise (humidité, exposition au soleil...).",
                "skills": [
                    "Node.js",
                    "IoT",
                    "Cordova",
                    "Agile methodologies"
                ]
            },
            {
                "bookmark": "research-paper",
                "title": "État de l'art : Documents hybrides et interaction crossmédia",
                "type": "paper",
                "description": "Ce projet de recherche vise à déterminer un état de l'art de différente solutions autour des documents hybrides et de l'interaction crossmédia (entre environnements physiques et numériques). Plusieurs projets et produits ont été comparés suivant différentes caractéristiques clés afin de comprendre les éléments constituant une interaction crossmédia optimale.",
                "skills": [
                    "Critical thinking",
                    "Research",
                    "Redaction"
                ]
            }
        ]
    },
    "contact": {
        "information": {
            "heading": "Vous souhaitez me contacter ?",
            "content": "Pour discuter d'un projet, d'une opportunité ou pour simplement obtenir plus d'informations sur moi, vous pouvez utiliser mes informations de contact pour m'envoyer un e-mail ou un message via LinkedIn ou WhatsApp. Vous pouvez également consulter mes différents profils sur le web.",
            "websiteRequest": "Une suggestion concernant ce site ou vous avez remarqué un bug ? Merci de m'envoyer un e-mail à "
        },
        "emailHeading": "Par e-mail",
        "webHeading": "Sur le web",
        "phoneHeading": "Par téléphone"
    }
}